# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [2]:
#Your code here
c.execute("""SELECT firstname, lastname
FROM employees e 
JOIN offices o ON e.officeCode = o.officeCode
WHERE o.city = 'Boston';""")
c.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [15]:
#Your code here
c.execute("""SELECT o.officeCode, city, COUNT(e.employeeNumber)
FROM offices o
LEFT JOIN employees e ON o.officeCode = e.officeCode
GROUP BY o.officeCode, city""")
c.fetchall()

[('1', 'San Francisco', 6),
 ('2', 'Boston', 2),
 ('3', 'NYC', 2),
 ('4', 'Paris', 5),
 ('5', 'Tokyo', 2),
 ('6', 'Sydney', 4),
 ('7', 'London', 2)]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
#What is the office city with the highest amount of sales?
#What is the name of the sales rep with the highest amount of sales?
#What is the product name with the highest number of orders?

In [20]:
# Your code here
c.execute("""SELECT of.city, SUM(od.quantityOrdered*od.priceEach) as sales
FROM orderdetails od
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
JOIN offices of ON e.officeCode = of.officeCode
GROUP BY of.city
ORDER BY sales DESC;""")
df = pd.DataFrame(c.fetchall())
df.columns = [column[0] for column in c.description]
df

            city       sales
0          Paris  3083761.58
1         London  1436950.70
2  San Francisco  1429063.57
3            NYC  1157589.72
4         Sydney  1147176.35
5         Boston   892538.62
6          Tokyo   457110.07

In [22]:
# Your code here
c.execute("""SELECT e.firstname, e.lastname, SUM(od.quantityOrdered*od.priceEach) as sales
FROM orderdetails od
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
GROUP BY e.firstname, e.lastname
ORDER BY sales DESC;""")
df = pd.DataFrame(c.fetchall())
df.columns = [column[0] for column in c.description]
df

   firstName   lastName       sales
0     Gerard  Hernandez  1258577.81
1     Leslie   Jennings  1081530.54
2     Pamela   Castillo   868220.55
3      Larry       Bott   732096.79
4      Barry      Jones   704853.91
5     George     Vanauf   669377.05
6      Peter      Marsh   584593.76
7       Loui     Bondur   569485.75
8       Andy     Fixter   562582.59
9      Steve  Patterson   505875.42
10  Foon Yue      Tseng   488212.67
11      Mami      Nishi   457110.07
12    Martin     Gerard   387477.47
13     Julie   Firrelli   386663.20
14    Leslie   Thompson   347533.03

In [23]:
# Your code here
c.execute("""SELECT p.productName, SUM(od.quantityOrdered)
FROM products p
JOIN orderDetails od ON p.productCode = od.productCode
GROUP BY p.productName
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [column[0] for column in c.description]
df

                                     productName  SUM(od.quantityOrdered)
0            18th Century Vintage Horse Carriage                      907
1                          18th century schooner                     1011
2                         1900s Vintage Bi-Plane                      940
3                        1900s Vintage Tri-Plane                     1009
4                              1903 Ford Model A                      883
5                            1904 Buick Runabout                      990
6                             1911 Ford Town Car                      832
7               1912 Ford Model T Delivery Wagon                      991
8                    1913 Ford Model T Speedster                     1038
9                       1917 Grand Touring Sedan                      918
10                      1917 Maxwell Touring Car                      992
11                         1926 Ford Fire Engine                      998
12              1928 British Royal Navy Airplane                      972
13                      1928 Ford Phaeton Deluxe                      972
14                        1928 Mercedes-Benz SSK                      880
15                  1930 Buick Marquette Phaeton                     1074
16           1932 Alfa Romeo 8C2300 Spider Sport                      866
17                     1932 Model A Ford J-Coupe                      957
18                            1934 Ford V8 Coupe                      985
19                         1936 Chrysler Airflow                      983
20           1936 Harley Davidson El Knucklehead                      945
21              1936 Mercedes Benz 500k Roadster                      824
22      1936 Mercedes-Benz 500K Special Roadster                      960
23                     1937 Horch 930V Limousine                      884
24                          1937 Lincoln Berline                     1111
25     1938 Cadillac V-16 Presidential Limousine                      955
26                       1939 Cadillac Limousine                      995
27                   1939 Chevrolet Deluxe Coupe                      937
28                      1940 Ford Delivery Sedan                      923
29                        1940 Ford Pickup Truck                      999
..                                           ...                      ...
79                              1995 Honda Civic                      917
80                         1996 Moto Guzzi 1100i                      999
81   1996 Peterbilt 379 Stake Bed with Outrigger                      988
82                              1997 BMW F650 ST                     1014
83                             1997 BMW R 1100 S                     1033
84                1998 Chrysler Plymouth Prowler                      986
85                  1999 Indy 500 Monte Carlo SS                      855
86                        1999 Yamaha Speed Boat                      966
87                             2001 Ferrari Enzo                     1019
88                           2002 Chevy Corvette                      894
89                              2002 Suzuki XREO                     1028
90                            2002 Yamaha YZR M1                      992
91          2003 Harley-Davidson Eagle Drag Bike                      985
92                                 ATA: B757-300                      973
93                America West Airlines B757-200                      984
94                   American Airlines: B767-300                      894
95                     American Airlines: MD-11S                     1085
96                              Boeing X-32A JSF                      960
97                      Collectable Wooden Train                      918
98                      Corsair F4U ( Bird Cage)                     1051
99              Diamond T620 Semi-Skirted Tanker                      979
100                           F/A 18 Hornet 1/72                     1047
101                                   HMS Bounty                      897
102                               P-51-D Mustang                      917
103                                   Pont Yacht                      958
104                                The Mayflower                      898
105                               The Queen Mary                      896
106                        The Schooner Bluenose                      934
107                                  The Titanic                      952
108                    The USS Constitution Ship                     1020

[109 rows x 2 columns]

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!